
const os = require('os')
console.log(os.arch())//Повертає архітектуру ЦП операційної системи, для якої було скомпільовано двійковий файл Node.js.
console.log(os.cpus()) // Повертає масив об'єктів, що містить інформацію про кожному логічному ядрі ЦП.
console.log(os.freemem())  //Повертає кількість вільної оперативної пам'яті в байтах у вигляді цілого числа.
console.log(os.homedir())  //Повертає строковий шлях до домашнього каталогу поточного користувача.
console.log(os.hostname()) //Повертає ім'я хоста операційної системи у вигляді рядка.
